АлогистикТест2/src/Documents/алк_ЗаказНаПроизводство/алк_ЗаказНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ЗаказНаПроизводство</name>
  <basedOn>Document.алк_ЗаказПокупателя</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПоЗаказуПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аддендумы</name>
    <attributes>
      <name>Аддендум</name>
      <type>
        <types>DocumentRef.алк_Аддендумы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВПроизводство</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>127</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийОбъем</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ЗаказНаПроизводство/Forms/ФормаВыбораСтроки/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	      
	Список.Отбор.Элементы.Очистить(); 
	
	Если ЗначениеЗаполнено(Параметры.РежимВыбора) Тогда
		Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	КонецЕсли;
	
	Если Параметры.Свойство("Аддендум") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Аддендум", Параметры.Аддендум);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	    
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	СтруктураВыбора = Новый Структура;
	СтруктураВыбора.Вставить("ИдентификаторТовара", 	ТекущиеДанные.ИдентификаторТовара);
	СтруктураВыбора.Вставить("ПредставлениеТовара", 	ТекущиеДанные.ПредставлениеТовара);
	СтруктураВыбора.Вставить("КоличествоВПроизводство", ТекущиеДанные.Количество);  
	
	ОповеститьОВыборе(СтруктураВыбора); 
	 
КонецПроцедуры
